IDEA Open Model
ResultPoint Class
Compatible with IDEA StatiCa Beta 20.0
Note: This API is now obsolete.
 Point of results
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultPoint
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[ObsoleteAttribute]
public class ResultPoint
<ObsoleteAttribute>
Public Class ResultPoint
The ResultPoint type exposes the following members.
Constructors
Name | Description
ResultPoint
Initializes a new instance of the ResultPoint class
Top
Properties
Name | Description
Id
 Id of Point
Point
 Location of Point
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace